tutorials/viscoelasticFluidFoam/PP/constant/viscoelasticProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          viscoelasticProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
From:
Rutgers, R.P.G.; Clemeur, N.; Muke S.; Debbaut B. Polyethylene flow prediction with a
differential multi-mode Pom-Pom model. Korea-Australia Rheology Journal
Vol. 14, No. 1, March 2002 pp. 25-32

Table 1. Parameters for the seven-mode pom-pom model
i   gi[Pa]   lbi[s]     lbi/lsi   qi
1   6.282e4  1.000e-2   2         2
2   1.113e4  4.641e-2   2         2
3   8.760e3  2.154e-1   2         2
4   2.405e3  1.000e0    2         2
5   4.968e2  4.641e0    2         16
6   4.662e1  2.154e1    2         20
7   3.156e0  1.000e2    1.5       32
*/

rheology
{
    type multiMode;

    models
    (
        first
        {
            type PP;
            rho              rho [1 -3 0 0 0 0 0] 850;
            etaS             etaS [1 -1 -1 0 0 0 0] 0.0;
            etaP             etaP [1 -1 -1 0 0 0 0] 628.2;
            lambdaOb         lambdaOb [0 0 1 0 0 0 0] 1.000e-2;
            lambdaOs         lambdaOs [0 0 1 0 0 0 0] 0.005;
            q                q [0 0 0 0 0 0 0] 2;
        }

        second
        {
            type PP;
            rho              rho [1 -3 0 0 0 0 0] 850;
            etaS             etaS [1 -1 -1 0 0 0 0] 0.0;
            etaP             etaP [1 -1 -1 0 0 0 0] 516.5433;
            lambdaOb         lambdaOb [0 0 1 0 0 0 0] 4.641e-2;
            lambdaOs         lambdaOs [0 0 1 0 0 0 0] 0.023205;
            q                q [0 0 0 0 0 0 0] 2;
        }

        third
        {
            type PP;
            rho              rho [1 -3 0 0 0 0 0] 850;
            etaS             etaS [1 -1 -1 0 0 0 0] 0.0;
            etaP             etaP [1 -1 -1 0 0 0 0] 1886.904;
            lambdaOb         lambdaOb [0 0 1 0 0 0 0] 2.154e-1;
            lambdaOs         lambdaOs [0 0 1 0 0 0 0] 0.1077;
            q                q [0 0 0 0 0 0 0] 2;
        }

        fourth
        {
            type PP;
            rho              rho [1 -3 0 0 0 0 0] 850;
            etaS             etaS [1 -1 -1 0 0 0 0] 0.0;
            etaP             etaP [1 -1 -1 0 0 0 0] 2405.0;
            lambdaOb         lambdaOb [0 0 1 0 0 0 0] 1.000e0;
            lambdaOs         lambdaOs [0 0 1 0 0 0 0] 0.5;
            q                q [0 0 0 0 0 0 0] 2;
        }

        fifth
        {
            type PP;
            rho              rho [1 -3 0 0 0 0 0] 850;
            etaS             etaS [1 -1 -1 0 0 0 0] 0.0;
            etaP             etaP [1 -1 -1 0 0 0 0] 2305.6488;
            lambdaOb         lambdaOb [0 0 1 0 0 0 0] 4.641e0;
            lambdaOs         lambdaOs [0 0 1 0 0 0 0] 2.3205;
            q                q [0 0 0 0 0 0 0] 16;
        }

        sixth
        {
            type PP;
            rho              rho [1 -3 0 0 0 0 0] 850;
            etaS             etaS [1 -1 -1 0 0 0 0] 0.0;
            etaP             etaP [1 -1 -1 0 0 0 0] 1004.1948;
            lambdaOb         lambdaOb [0 0 1 0 0 0 0] 2.154e1;
            lambdaOs         lambdaOs [0 0 1 0 0 0 0] 10.77;
            q                q [0 0 0 0 0 0 0] 20;
        }

        seventh
        {
            type PP;
            rho              rho [1 -3 0 0 0 0 0] 850;
            etaS             etaS [1 -1 -1 0 0 0 0] 0.0;
            etaP             etaP [1 -1 -1 0 0 0 0] 315.6;
            lambdaOb         lambdaOb [0 0 1 0 0 0 0] 1.000e2;
            lambdaOs         lambdaOs [0 0 1 0 0 0 0] 66.666667;
            q                q [0 0 0 0 0 0 0] 32;
        }
    );
} 


// ************************************************************************* //
